package com.zzm.mvpdemo.beans;

import java.util.List;

/**
 * Created by PrettyBoy on 2016/5/3.
 */
public class JokeBean {


    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allNum":23864,"allPages":1194,"contentlist":[{"ct":"2016-05-03 13:00:06.290","id":"572830566e36851c21e8f3dd","text":"、怀孕8个半月，宝宝在肚子里总是拱来拱去，肚皮上就时不时的出现个小鼓包。老公看到，兴奋极了，对我说，来，我们来玩砸地鼠吧。","title":"怀孕8个半月","type":1},{"ct":"2016-05-03 10:30:37.143","id":"57280d4d6e36851c21e876b0","text":"智力测试（高难度）<\/p><p>1、在一条街上，有5座房子，喷了5种颜色。<\/p><p>2、每个房里住着不同国籍的人 　<\/p><p>3、每个人喝不同的饮料，抽不同品牌的香烟，养不同的宠物 　<\/p><p>问题是：谁养鱼？<\/p><p>提示：<\/p><p>1、英国人住红色房子<\/p><p>2、瑞典人养狗<\/p><p>3、丹麦人喝茶<\/p><p>4、绿色房子在白色房子左面<\/p><p>5、绿色房子主人喝咖啡<\/p><p>6、抽Pall Mall 香烟的人养鸟<\/p><p>7、黄色房子主人抽Dunhill 香烟<\/p><p>8、住在中间房子的人喝牛奶<\/p><p>9、 挪威人住第一间房<\/p><p>10、抽Blends香烟的人住在养猫的人隔壁<\/p><p>11、养马的人住抽Dunhill 香烟的人隔壁<\/p><p>12、抽Blue Master的人喝啤酒<\/p><p>13、德国人抽Prince香烟<\/p><p>14、挪威人住蓝色房子隔壁<\/p><p>15、抽Blends香烟的人有一个喝水的邻居<\/p><p>爱因斯坦在20世纪初出的这个谜语。他说世界上有98％的人答不出来","title":"爱因斯坦出的智力测试","type":1},{"ct":"2016-05-03 09:30:35.540","id":"5727ff3b6e36851c21e83d07","text":"车间里很吵，嘈杂声很大，我和一女同事聊天，我趴在她耳朵上大声说：\u201c你有男朋友吗？\u201d<\/p><p> 她说：\u201c什么呀你大点声。\u201d<\/p><p> 我又趴在他耳朵上大声吼道：\u201c我说，你有男朋友吗？\u201d<\/p><p> 她说：\u201c你大点声好不好，我听不清楚啊，\u201d<\/p><p> 我的声音更大了：\u201c我说，你有男朋友吗？听清楚了没有。\u201d<\/p><p> 她说：\u201c你没吃饭啊大点声好不好啊。\u201d<\/p><p> 我生气了，趴在她耳朵上大声吼道：\u201c我说，我是你大爷。\u201d<\/p><p> 她一个转身，一脚踢在了我的屁股上。<\/p><p> 尼玛，这你听的怪清楚。","title":"车间里的事儿","type":1},{"ct":"2016-05-03 09:30:35.540","id":"5727ff3b6e36851c21e83d06","text":"两口子一起钓鱼，老婆半天也钓不到。她问：老公，\u201c沉鱼落雁\u201d是什么意思？老公：是说西施长得太美了，连鱼儿都害羞得躲到水底。她：哦，怪不得我钓不到鱼。","title":"两口子一起钓鱼，老婆半天也钓不到","type":1},{"ct":"2016-05-03 09:30:35.540","id":"5727ff3b6e36851c21e83d05","text":"今天在公园遛狗，看到一个五岁左右的小孩问另一个小孩：\u201c你看到我奶奶了吗？\u201d\u201c没\u2026没有，不过我家也有奶奶，要不你跟我回家吧。\u201d","title":"看到一个五岁左右的小孩问另一个小孩","type":1},{"ct":"2016-05-03 09:30:35.540","id":"5727ff3b6e36851c21e83d04","text":"五岁的哥哥看到只虫子，对三岁的弟弟说：\u201c我捏着它，你去拿个砖头砸死它\u201d。然后弟弟就去找砖头了，再然后，哥哥就哭着找妈妈去了\u2026\u2026","title":"五岁的哥哥看到只虫子，对三岁的弟弟说","type":1},{"ct":"2016-05-03 09:30:35.540","id":"5727ff3b6e36851c21e83d03","text":"老师说：伸手不打笑脸人，嗯，看你笑得这么贱，我只能用脚踹了","title":"伸手不打笑脸人","type":1},{"ct":"2016-05-03 09:30:35.540","id":"5727ff3b6e36851c21e83d02","text":"有天在宾馆大厅等个人，过来一服务员：这里不能抽烟。我往左走了几步，问：\u201c这里呢？\u201d\u201c先生这里也不能抽烟，\u201d我又往左走了几步：\u201c这里那？\u201d服务员没好气的翻着白眼：\u201c你都快抽完了，还问啥！\u201d","title":"过来一服务员：这里不能抽烟","type":1},{"ct":"2016-05-03 09:30:35.423","id":"5727ff3b6e36851c21e83cfe","text":"早晨吃早点，一年轻麻麻带着一五六岁小姑娘吃饭，貌似因为找钱问题跟老板争论起来。老板声音有点大，这时正在吃面条的小萌妹来了一句：叔叔你不要欺负我妈妈好不好，她更年期到了，伤不起的\u2026\u2026","title":"早晨吃早点，一年轻麻麻带着一五六岁小姑娘","type":1},{"ct":"2016-05-03 09:30:35.384","id":"5727ff3b6e36851c21e83cfc","text":"老婆跟我说：\u201c老公，我的手机用了两年了，是不是该换了？\u201d我：\u201c我俩处了有三年了，是不是。。。那啥，感情不是越来越深了么！\u201d顿时感觉我好机智呀好机智。。。","title":"老公，我的手机用了两年了，是不是该换了","type":1},{"ct":"2016-05-03 09:30:35.384","id":"5727ff3b6e36851c21e83cfb","text":"书到用时方恨少。说得太对了，如果还有一本书垫着，我想，我会睡得更舒服。","title":"书到用时方恨少","type":1},{"ct":"2016-05-02 14:00:09.968","id":"5726ece96e36851c21e445bd","text":"我上厕所看见鬼了我大叫:妈妈有鬼<\/p><p>鬼说:我是你妈妈呀<\/p><p>从此我上厕所都要小心翼翼","title":"见鬼了","type":1},{"ct":"2016-05-02 11:00:03.877","id":"5726c2b36e36851c21e3ad8e","text":"我在手机上设置了一个屏幕碎裂的桌面，拿去和朋友开玩笑 。　　　　朋友要用我的手机，我递给他的时候故意轻轻的掉在了桌子上，然后他捡起来，傻眼了 。　　屏幕显示的是碎裂的图案，我哈哈大笑，拿过手机将桌面换掉，然后，发现，屏幕还是碎裂的！","title":"屏幕碎裂的桌面","type":1},{"ct":"2016-05-02 11:00:03.853","id":"5726c2b36e36851c21e3ad8d","text":"早上去银行存钱，新来的保安不让我进，堵着门口对我说：\u201c你带着眼镜，不能进去，要把眼镜脱下来才能进。\u201d　　我当时有种想狂笑的冲动\u2026\u2026后来大堂经理来了，很尴尬的告诉他，银行规定是墨镜。","title":"新来的保安不让我进","type":1},{"ct":"2016-05-02 11:00:03.853","id":"5726c2b36e36851c21e3ad8c","text":"宿舍离厕所甚远，晚上嘘嘘直接用统一绿茶，然后就拧紧放桌子上。　　次日上午体育课中途回寝室，饥渴难耐状，然后\u2026\u2026沃槽，拿错了!!!","title":"拿错了","type":1},{"ct":"2016-05-02 11:00:03.853","id":"5726c2b36e36851c21e3ad8b","text":"\u201c警察先生，求求你把我关进牢里吧！我刚刚喝醉酒，拿根棍子打蚊子，结果打在我老婆头上。\u201d　　\u201c你打死她了？\u201d　　\u201c坏就坏在没有，所以请你赶快把我关起来。\u201d","title":"比坐牢还可怕","type":1},{"ct":"2016-05-02 11:00:03.834","id":"5726c2b36e36851c21e3ad8a","text":"我弟的朋友的弟弟，也就7，8岁那样，他爷爷去世的时候，他爸哭的稀里哗啦的，他弟弟跑过去就对爸爸说，爸爸，你没爸爸了，我可以当你爸爸呀。他爸爸直接炸了，拉住就是一顿揍啊。","title":"说个我老家的事","type":1},{"ct":"2016-05-02 11:00:03.833","id":"5726c2b36e36851c21e3ad89","text":"朋友是彩超医生，，一次来了个黑人做腹部彩超，朋友用彩超探头接触他皮肤之后，又拿起来看看探头。。躺在床上的黑人无奈的看着朋友用生硬的汉语说：嘿！！我不掉色。","title":"是无知还是种族歧视？","type":1},{"ct":"2016-05-02 11:00:03.833","id":"5726c2b36e36851c21e3ad88","text":"昨天去一同事家，进门见他妈在忙，便礼貌性的叫了句阿姨好！那女的愣了愣，说我有那么老吗？我还没反应过来，同事吼到\u201c那是我老婆，我妈不在这边。\u201d 我\u2026\u2026\u2026我\u2026\u2026我TM再也不想去他家了！！","title":"这事可太尴尬了","type":1},{"ct":"2016-05-02 11:00:03.833","id":"5726c2b36e36851c21e3ad87","text":"去公共澡堂洗澡，擦背师傅边给我搓边抱怨道：小兄弟，我年纪大了，手上没劲，挣你几个钱不容易，你去xx路那家吧！那是我徒弟，年轻有力，还经得起折腾，多少灰都能给你搓下来！\u201d","title":"所以说人老就该退休","type":1}],"currentPage":1,"maxResult":20,"ret_code":0}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    /**
     * allNum : 23864
     * allPages : 1194
     * contentlist : [{"ct":"2016-05-03 13:00:06.290","id":"572830566e36851c21e8f3dd","text":"、怀孕8个半月，宝宝在肚子里总是拱来拱去，肚皮上就时不时的出现个小鼓包。老公看到，兴奋极了，对我说，来，我们来玩砸地鼠吧。","title":"怀孕8个半月","type":1},{"ct":"2016-05-03 10:30:37.143","id":"57280d4d6e36851c21e876b0","text":"智力测试（高难度）<\/p><p>1、在一条街上，有5座房子，喷了5种颜色。<\/p><p>2、每个房里住着不同国籍的人 　<\/p><p>3、每个人喝不同的饮料，抽不同品牌的香烟，养不同的宠物 　<\/p><p>问题是：谁养鱼？<\/p><p>提示：<\/p><p>1、英国人住红色房子<\/p><p>2、瑞典人养狗<\/p><p>3、丹麦人喝茶<\/p><p>4、绿色房子在白色房子左面<\/p><p>5、绿色房子主人喝咖啡<\/p><p>6、抽Pall Mall 香烟的人养鸟<\/p><p>7、黄色房子主人抽Dunhill 香烟<\/p><p>8、住在中间房子的人喝牛奶<\/p><p>9、 挪威人住第一间房<\/p><p>10、抽Blends香烟的人住在养猫的人隔壁<\/p><p>11、养马的人住抽Dunhill 香烟的人隔壁<\/p><p>12、抽Blue Master的人喝啤酒<\/p><p>13、德国人抽Prince香烟<\/p><p>14、挪威人住蓝色房子隔壁<\/p><p>15、抽Blends香烟的人有一个喝水的邻居<\/p><p>爱因斯坦在20世纪初出的这个谜语。他说世界上有98％的人答不出来","title":"爱因斯坦出的智力测试","type":1},{"ct":"2016-05-03 09:30:35.540","id":"5727ff3b6e36851c21e83d07","text":"车间里很吵，嘈杂声很大，我和一女同事聊天，我趴在她耳朵上大声说：\u201c你有男朋友吗？\u201d<\/p><p> 她说：\u201c什么呀你大点声。\u201d<\/p><p> 我又趴在他耳朵上大声吼道：\u201c我说，你有男朋友吗？\u201d<\/p><p> 她说：\u201c你大点声好不好，我听不清楚啊，\u201d<\/p><p> 我的声音更大了：\u201c我说，你有男朋友吗？听清楚了没有。\u201d<\/p><p> 她说：\u201c你没吃饭啊大点声好不好啊。\u201d<\/p><p> 我生气了，趴在她耳朵上大声吼道：\u201c我说，我是你大爷。\u201d<\/p><p> 她一个转身，一脚踢在了我的屁股上。<\/p><p> 尼玛，这你听的怪清楚。","title":"车间里的事儿","type":1},{"ct":"2016-05-03 09:30:35.540","id":"5727ff3b6e36851c21e83d06","text":"两口子一起钓鱼，老婆半天也钓不到。她问：老公，\u201c沉鱼落雁\u201d是什么意思？老公：是说西施长得太美了，连鱼儿都害羞得躲到水底。她：哦，怪不得我钓不到鱼。","title":"两口子一起钓鱼，老婆半天也钓不到","type":1},{"ct":"2016-05-03 09:30:35.540","id":"5727ff3b6e36851c21e83d05","text":"今天在公园遛狗，看到一个五岁左右的小孩问另一个小孩：\u201c你看到我奶奶了吗？\u201d\u201c没\u2026没有，不过我家也有奶奶，要不你跟我回家吧。\u201d","title":"看到一个五岁左右的小孩问另一个小孩","type":1},{"ct":"2016-05-03 09:30:35.540","id":"5727ff3b6e36851c21e83d04","text":"五岁的哥哥看到只虫子，对三岁的弟弟说：\u201c我捏着它，你去拿个砖头砸死它\u201d。然后弟弟就去找砖头了，再然后，哥哥就哭着找妈妈去了\u2026\u2026","title":"五岁的哥哥看到只虫子，对三岁的弟弟说","type":1},{"ct":"2016-05-03 09:30:35.540","id":"5727ff3b6e36851c21e83d03","text":"老师说：伸手不打笑脸人，嗯，看你笑得这么贱，我只能用脚踹了","title":"伸手不打笑脸人","type":1},{"ct":"2016-05-03 09:30:35.540","id":"5727ff3b6e36851c21e83d02","text":"有天在宾馆大厅等个人，过来一服务员：这里不能抽烟。我往左走了几步，问：\u201c这里呢？\u201d\u201c先生这里也不能抽烟，\u201d我又往左走了几步：\u201c这里那？\u201d服务员没好气的翻着白眼：\u201c你都快抽完了，还问啥！\u201d","title":"过来一服务员：这里不能抽烟","type":1},{"ct":"2016-05-03 09:30:35.423","id":"5727ff3b6e36851c21e83cfe","text":"早晨吃早点，一年轻麻麻带着一五六岁小姑娘吃饭，貌似因为找钱问题跟老板争论起来。老板声音有点大，这时正在吃面条的小萌妹来了一句：叔叔你不要欺负我妈妈好不好，她更年期到了，伤不起的\u2026\u2026","title":"早晨吃早点，一年轻麻麻带着一五六岁小姑娘","type":1},{"ct":"2016-05-03 09:30:35.384","id":"5727ff3b6e36851c21e83cfc","text":"老婆跟我说：\u201c老公，我的手机用了两年了，是不是该换了？\u201d我：\u201c我俩处了有三年了，是不是。。。那啥，感情不是越来越深了么！\u201d顿时感觉我好机智呀好机智。。。","title":"老公，我的手机用了两年了，是不是该换了","type":1},{"ct":"2016-05-03 09:30:35.384","id":"5727ff3b6e36851c21e83cfb","text":"书到用时方恨少。说得太对了，如果还有一本书垫着，我想，我会睡得更舒服。","title":"书到用时方恨少","type":1},{"ct":"2016-05-02 14:00:09.968","id":"5726ece96e36851c21e445bd","text":"我上厕所看见鬼了我大叫:妈妈有鬼<\/p><p>鬼说:我是你妈妈呀<\/p><p>从此我上厕所都要小心翼翼","title":"见鬼了","type":1},{"ct":"2016-05-02 11:00:03.877","id":"5726c2b36e36851c21e3ad8e","text":"我在手机上设置了一个屏幕碎裂的桌面，拿去和朋友开玩笑 。　　　　朋友要用我的手机，我递给他的时候故意轻轻的掉在了桌子上，然后他捡起来，傻眼了 。　　屏幕显示的是碎裂的图案，我哈哈大笑，拿过手机将桌面换掉，然后，发现，屏幕还是碎裂的！","title":"屏幕碎裂的桌面","type":1},{"ct":"2016-05-02 11:00:03.853","id":"5726c2b36e36851c21e3ad8d","text":"早上去银行存钱，新来的保安不让我进，堵着门口对我说：\u201c你带着眼镜，不能进去，要把眼镜脱下来才能进。\u201d　　我当时有种想狂笑的冲动\u2026\u2026后来大堂经理来了，很尴尬的告诉他，银行规定是墨镜。","title":"新来的保安不让我进","type":1},{"ct":"2016-05-02 11:00:03.853","id":"5726c2b36e36851c21e3ad8c","text":"宿舍离厕所甚远，晚上嘘嘘直接用统一绿茶，然后就拧紧放桌子上。　　次日上午体育课中途回寝室，饥渴难耐状，然后\u2026\u2026沃槽，拿错了!!!","title":"拿错了","type":1},{"ct":"2016-05-02 11:00:03.853","id":"5726c2b36e36851c21e3ad8b","text":"\u201c警察先生，求求你把我关进牢里吧！我刚刚喝醉酒，拿根棍子打蚊子，结果打在我老婆头上。\u201d　　\u201c你打死她了？\u201d　　\u201c坏就坏在没有，所以请你赶快把我关起来。\u201d","title":"比坐牢还可怕","type":1},{"ct":"2016-05-02 11:00:03.834","id":"5726c2b36e36851c21e3ad8a","text":"我弟的朋友的弟弟，也就7，8岁那样，他爷爷去世的时候，他爸哭的稀里哗啦的，他弟弟跑过去就对爸爸说，爸爸，你没爸爸了，我可以当你爸爸呀。他爸爸直接炸了，拉住就是一顿揍啊。","title":"说个我老家的事","type":1},{"ct":"2016-05-02 11:00:03.833","id":"5726c2b36e36851c21e3ad89","text":"朋友是彩超医生，，一次来了个黑人做腹部彩超，朋友用彩超探头接触他皮肤之后，又拿起来看看探头。。躺在床上的黑人无奈的看着朋友用生硬的汉语说：嘿！！我不掉色。","title":"是无知还是种族歧视？","type":1},{"ct":"2016-05-02 11:00:03.833","id":"5726c2b36e36851c21e3ad88","text":"昨天去一同事家，进门见他妈在忙，便礼貌性的叫了句阿姨好！那女的愣了愣，说我有那么老吗？我还没反应过来，同事吼到\u201c那是我老婆，我妈不在这边。\u201d 我\u2026\u2026\u2026我\u2026\u2026我TM再也不想去他家了！！","title":"这事可太尴尬了","type":1},{"ct":"2016-05-02 11:00:03.833","id":"5726c2b36e36851c21e3ad87","text":"去公共澡堂洗澡，擦背师傅边给我搓边抱怨道：小兄弟，我年纪大了，手上没劲，挣你几个钱不容易，你去xx路那家吧！那是我徒弟，年轻有力，还经得起折腾，多少灰都能给你搓下来！\u201d","title":"所以说人老就该退休","type":1}]
     * currentPage : 1
     * maxResult : 20
     * ret_code : 0
     */

    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        private int allNum;
        private int allPages;
        private int currentPage;
        private int maxResult;
        private int ret_code;
        /**
         * ct : 2016-05-03 13:00:06.290
         * id : 572830566e36851c21e8f3dd
         * text : 、怀孕8个半月，宝宝在肚子里总是拱来拱去，肚皮上就时不时的出现个小鼓包。老公看到，兴奋极了，对我说，来，我们来玩砸地鼠吧。
         * title : 怀孕8个半月
         * type : 1
         */

        private List<ContentlistBean> contentlist;

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            private String ct;
            private String id;
            private String text;
            private String title;
            private int type;

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }
        }
    }
}
